{"README":{"title":"README","links":[],"tags":[],"content":"”# _blog”"},"_templates/card":{"title":"card","links":[],"tags":[],"content":""},"_templates/post":{"title":"post","links":[],"tags":[],"content":""},"_Анализ-публикаций":{"title":"_Анализ публикаций","links":[],"tags":[],"content":"table WITHOUT ID file.link as &quot;Название&quot;, file.frontmatter.date as &quot;Дата публикации&quot; from &quot;posts&quot; sort file.frontmatter.date desc"},"cards/BABOK":{"title":"BABOK","links":[],"tags":[],"content":"BABOK (Business Analysis Body of Knowledge) - Свод знаний по бизнес-анализу.\nЭто документ, разработанный IIBA (Международный институт бизнес-анализа). На основании Свода разработано BABOK Guide - руководства к Своду знаний по бизнес-анализу.  Скачать 3-ю версию Руководства можно здесь.\nРуководство BABOK содержит описание общепринятых практик в области бизнес-анализа."},"cards/BACCM":{"title":"BACCM","links":["cards/BABOK"],"tags":[],"content":"BABOK\nBACCM - Модель базовых понятий бизнес-анализа.\nМодель состоит из шести терминов, которые имеют общее значение для всех бизнес-аналитиков, что помогает им использовать единую терминологию при обсуждении бизнес-анализа и того, что с ним связано.\nШесть базовых понятий BACCM:\n\nИзменение - Преобразования в ответ на потребность. Цель изменения - повысить производительность предприятия. Эти улучшения являются преднамеренными и управляются с помощью бизнес- анализа.\nПотребность - Проблема или возможность, подлежащая рассмотрению. Потребности могут вызывать изменения, побуждая заинтересованные стороны к действиям. Изменения, в свою очередь, также могут порождать потребности, снижая или увеличивая ценность существующих решений.\nРешение - Конкретный способ удовлетворения одной или нескольких потребностей в некотором контексте. Решение удовлетворяет потребность путем разрешения проблемы, с которой сталкиваются заинтересованные стороны, или позволяя заинтересованным сторонам реализовать возможность\nЗаинтересованная сторона -Лицо или группа лиц, имеющие отношение к изменению, потребности или решению. Заинтересованные стороны, как правило, могут быть определены в терминах заинтересованности в (изменении - прим. пер.), влияния (изменения - прим. пер.) на (заинтересованные стороны - прим. пер.) и воздействия (заинтересованных сторон - прим. пер.) на изменение. Заинтересованные стороны группируются по их отношению к потребностям, изменениям или решениям.\nЦенность - Стоимость, важность или полезность чего-либо для заинтересованной стороны в данном контексте. Под ценностью могут пониматься потенциальные или реализованные прибыли, выгоды и улучшения. Также возможно снижение ценности в виде потерь, рисков и издержек. Ценность может быть материальной или нематириальной. Материальную ценность можно измерить напрямую. Материальная ценность зачастую имеет значительную денежную составляющую. Нематериальная ценность измеряется косвенно. Нематериальная ценность часто имеет значительный мотивационный компонент, такой как репутация компании или моральный дух сотрудников. В некоторых случаях ценность можно измерить в абсолютных категориях, но во многих случаях она оценивается в относительных величинах: один вариант решения ценнее другого с точки зрения данного множества заинтересованных сторон.\nКонтекст - Обстоятельства и условия, которые влияют на изменение, которые находятся под влиянием изменения, или которые способствуют пониманию изменения. Изменения происходят в некотором контексте. Контекст — это все, что относится к изменению в рамках его среды. Контекст может включать настроения, виды поведения, убеждения, конкурентов, культуру, демографию, цели, правительства, инфраструктуру, языки, потери, процессы, продукты, проекты, продажи, времена года, терминологию, технологию, погоду и любые другие элементы, соответствующие этому определению\n"},"cards/CBOK":{"title":"CBOK","links":[],"tags":[],"content":""},"cards/SWOT-анализ":{"title":"SWOT-анализ","links":["cards/BABOK"],"tags":[],"content":"BABOK\nSWOT-анализ — это простой, но действенный инструмент, используемый\nдля оценки преимуществ, слабых мест, возможностей и угроз для\nвнутренних и внешних условий организации.\nподкрепляемый доказательствами язык. SWOT-анализ служит для\nоценки организации относительно определённых факторов успеха.\nSWOT может выполняться на любом уровне, от предприятия в целом, до\nподразделения, бизнес-единицы, проекта, или даже отдельного\nчеловека. Выполняя SWOT-анализ должным образом, заинтересованные\nстороны получают более ясное понимание влияния существующего\nмножества условий на множество условий в будущем.\nSWOT-анализ может использоваться для:\n• оценки текущей среды организации,\n• обмена полученной информацией с заинтересованными\nсторонами,\n• определения лучших возможных вариантов для удовлетворения\nпотребностей организации,\n• выявления потенциальных препятствий для успеха и создания\nпланов действий по преодолению препятствий,\n• корректировки и пересмотра планов в ходе проекта по мере\nвозникновения новых потребностей,\n• определения сильных сторон, которые помогут организации в\nреализации новых стратегий,\n• разработки критериев для оценки успеха проекта, исходя из\nданного набора требований,\n• определения слабых мест, способных помешать достижению целей\nпроекта,\n• разработки стратегий по устранению существующих угроз.\nand Threats” (Преимущества, Недостатки, Возможности, Угрозы):\n• Преимущества (Strengths): нечто, что оцениваемая группа делает\nхорошо. Может включать опытный персонал, эффективные\nпроцессы, информационные системы, отношения с клиентами или\nлюбой другой внутренний фактор, ведущий к успеху.\n• Недостатки (Weaknesses): действия или функции, которые\nоцениваемая группа делает плохо или не делает совсем.\n• Возможности (Opportunities): внешние факторы, преимущество\nкоторых может использовать оцениваемая группа. Может\nвключать новые рынки, новую технологию, изменения на\nконкурентном рынке или другие силы.\n• Угрозы (Threats): внешние факторы, способные негативно повлиять\nна оцениваемую группу. Они могут включать такие факторы, как\nвыход на рынок нового конкурента, экономические спады или\nдругие силы.\nSWOT-анализ начинают с возможностей и угроз, что задает контекст для\nопределения преимуществ и недостатков."},"cards/Анализ-стратегий":{"title":"Анализ стратегий","links":["cards/BABOK","theory/Компетенции-бизнес-анализа","cards/Анализ-текущего-состояния","cards/BACCM"],"tags":[],"content":"BABOK Компетенции бизнес-анализа\n\nАнализ текущего состояния: понимание бизнес-потребности и того, как на она связана с нынешней работой предприятия. Задает точку отсчета и контекст изменения.\nОпределение будущего состояния: определяет цели и целевые показатели, которые продемонстрируют что бизнес-потребность была удовлетворена, а также определяет части предприятия, которые нужно изменить для достижения этих целей и целевых показателей.\nОценка рисков: дает понимание неопределенностей, связанных с изменением, учитывает влияние, которое эти неопределенности могут оказать на способность представлять ценность посредством изменения, и рекомендует действия по устранению рисков, где это необходимо.\nОпределение стратегии изменений: анализирует разрыв между текущим и будущим состояниями, оценивает варианты достижения будущего состояния и рекомендует подход к достижению будущего состояния, дающий наибольшую ценность, включая переходные состояния, которые могут потребоваться на пути\n\nСвязь базовых понятий BACCM и действий аналитика\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nБазовое понятиеДействие аналитикаИзменение: акт преобразования в ответ на потребность.определяют будущее состояние и разрабатывают стратегию изменений для достижения будущего состоянияПотребность: проблема или возможность, подлежащая рассмотрению.выявляют потребности в рамках текущего состояния и приоритизируют потребности для определения желаемого будущего состоянияРешение: конкретный способ удовлетворения одной или более потребностей в данном контексте.определяют скоуп решения как часть разработки стратегии изменений.Заинтересованная сторона: лицо или группа лиц, имеющие отношение к изменению, потребности или решению.сотрудничают с заинтересованными сторонами для понимания бизнеспотребности и разработки стратегии изменений и будущего состояния, которое удовлетворит эти потребности.Ценность: стоимость, важность или полезность чего-либо для заинтересованной стороны в данном контексте.изучают потенциальную ценность решения для оценки целесообразности изменения.Контекст: обстоятельства, влияющие на изменение, затрагиваемые им, или обеспечивающие его понимание.учитывают контекст предприятия в разработке стратегии изменений."},"cards/Анализ-текущего-состояния":{"title":"Анализ текущего состояния","links":["cards/BABOK"],"tags":[],"content":"BABOK\nЦель анализа текущего состояния — это понимание причин, по которым предприятию нужно изменить какие-либо аспекты своей работы, а также того, что это изменение прямо или косвенно затронет.\nВозможные причины изменений\n\nБизнес-потребности - — это проблемы и возможности стратегической важности, с которыми сталкивается предприятие. Проблемы, возникающие в организации, такие как жалобы клиентов, падение прибыли или новые рыночные возможности, обычно инициируют оценку потребности бизнеса\nВозможности и Процессы - Они измеряются показателями эффективности, которые можно использоваться для оценки выгоды изменения\nВнешние воздействия\n\n"},"cards/Анализ-требований-и-определение-дизайна":{"title":"Анализ требований и определение дизайна","links":["cards/BABOK","cards/Критерии-верификации-требований","cards/Цели-вариантов-решения","cards/BACCM"],"tags":[],"content":"BABOK\n\nСпецификация и моделирование требований: подробное описание набора требований или дизайнов с использованием аналитических методов.\nВерификация требований: проверка того, что набор требований или дизайнов проработан достаточно детально для использования конкретной заинтересованной стороной, внутренне непротиворечив и высокого качества. Критерии верификации требований\nВалидация требований: проверка того, что набор требований или дизайнов полезен для бизнеса и поддерживает цели и задачи организации.\nОпределение архитектуры требований: структурирование всех требований и дизайнов так, чтобы они поддерживали конечную бизнес-цель изменения и успешно работали как единое целое.\nОпределение вариантов решения: выявление, изучение и описание различных возможных путей удовлетворения потребности бизнеса. Цели вариантов решения\nАнализ потенциальной ценности и рекомендация решения: оценка бизнес-ценности, связанной с потенциальным решением и сравнение различных вариантов, включая компромиссы, для определения и рекомендации варианта решения, приносящего наибольшую общую пользу.\n\nСвязь базовых понятий BACCM и действий аналитика\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nБазовое понятиеДействие аналитикаИзменение: акт преобразования в ответ на потребность.преобразуют результаты выявления в требования и дизайны для определения измененияПотребность: проблема или возможность, подлежащая рассмотрению.анализируют потребности для рекомендации решения, удовлетворяющего эти потребности.Решение: конкретный способ удовлетворения одной или более потребностей в данном контексте.определяют варианты решения и рекомендуют тот, который вероятнее всего удовлетворит потребность и имеет большую ценность.Заинтересованная сторона: лицо или группа лиц, имеющие отношение к изменению, потребности или решению.адаптируют требования и дизайны так, чтобы они были понятны и пригодны каждой группе заинтересованных сторон.Ценность: стоимость, важность или полезность чего-либо для заинтересованной стороны в данном контексте.анализируют и количественно оценивают потенциальную ценность вариантов решения.Контекст: обстоятельства, влияющие на изменение, затрагиваемые им, или обеспечивающие его понимание.моделируют и описывают контекст в форматах, понятных и пригодных для всех заинтересованных сторон."},"cards/Атрибуты-требований":{"title":"Атрибуты требований","links":[],"tags":[],"content":"\nАбсолютная ссылка: предоставляет уникальный идентификатор. Такая ссылка не изменяется и не используется повторно при перемещении, изменении или удалении требования.\nАвтор: содержит имя человека, с которым следует консультироваться если впоследствии окажется, что требование является двусмысленным, неясным или противоречивым.\nСложность: показывает, насколько сложно выполнить требование.\nВладелец: указывает человека или группу лиц, которым нужно данное требование или которые станут его бизнес-владельцами после реализации решения.\nПриоритет: отражает относительную важность требований. Приоритет может определять относительную ценность требования или очередность, в которой оно будет реализовано.\nРиски: определяют непредвиденные события, способные повлиять на требования.\nИсточник: определяет происхождение требования. С источником часто консультируются, когда требование изменяется, либо когда необходимо получить дополнительную информации о требовании или породившей его потребности.\nСтабильность: показывает зрелость требования.\nСтатус: показывает текущее состояние требования, является ли оно предложенным, принятым, проверенным, отложенным, отмененным или реализованным.\nСрочность: указывает, как скоро потребуется это требование. Обычно, это необходимо определять отдельно от приоритета только, когда есть крайний срок реализации.\nОценка эффективности бизнес-анализа: представляет результаты предыдущих оценок, которые должны быть рассмотрены и учтены во всех подходах к планированию.\nБизнес-политики: определяют границы, в рамках которых должны приниматься решения. Они могут описываться правилами, договорами, соглашениями, гарантиями, сертификациями или другими правовыми обязательствами.\nИнструменты управления информацией: каждая организация использует какие-то инструменты для хранения, извлечения и обмена информацией бизнес-анализа. Они могут быть простыми как, например, маркерная доска, или сложными, как глобальная wiki или полноценная система управления требованиями.\nЮридическая/нормативная информация: описывает подлежащие соблюдению законодательные нормы или правила, а также помогает определить, как управлять информацией бизнес-анализа.\n"},"cards/Атрибуты-ценности":{"title":"Атрибуты ценности","links":[],"tags":[],"content":"Атрибуты ценности — это характеристики решения, которые определяют его ценность для заинтересованных сторон или существенно влияют на нее.\nК примерам атрибутов ценности относятся:\n\nвозможность предоставлять конкретную информацию\nвозможность выполнять или поддерживать конкретные действия,\nхарактеристики производительности и отзывчивости,\nприменимость решения в конкретных ситуациях и контекстах,\nналичие конкретных свойств и возможностей,\nудобство, защищенность, масштабируемость и надежность.\n\nЦенность для заинтересованных лиц представляют:\n\nповышенная производительность;\nменьшее количество переделок;\nснижение себестоимости;\nускорение бизнес-процессов;\nавтоматизация задач, ранее выполнявшихся вручную;\nвозможность выполнять совершенно новые задачи;\nсоответствие соответствующим стандартам и правилам;\nлучшая, по сравнению с текущими продуктами, легкость и простота использования;\n"},"cards/Гибкая-разработка-(agile)":{"title":"Гибкая разработка (agile)","links":[],"tags":[],"content":"Под гибкой разработкой (agile development) подразумевают набор методов разработки  ПО,  обеспечивающих  постоянное  сотрудничество  между  заинтересованными лицами и быстрый и частый выпуск функциональности небольшими  порциями.\nПроект разбивается на короткие циклы, называемые итерациями (в методе гибкой разработки под названием Scrum они называются «спринтами»).   На протяжении  итерации  команда  добавляется  небольшой  набор функциональности, основываясь на определенных клиентом приоритетах. В последующих итерациях меняется уже сделанное, расширяются исходные функции и устраняются обнаруженные дефекты.\nРезерв  (backlog)  проекта  гибкой  разработки  содержит  список  запросов  на работу,  которую  должна  выполнить  команда проекта.  Резервы  проектов обычно состоят из пользовательских историй, но в некоторых командах их наполняют другими требованиями, бизнес-процессами и дефектами, которые нужно устранить. Расстановка приоритетов в резерве выполняется регулярно — одни задачи выбираются на следующие итерации, а другие отбрасываются.\nОбъем пользовательской истории определяют так, чтобы ее реализация\nмогла уложиться в одну итерацию. Эпик (epic) - пользовательскую историю, которая слишком велика для реализации в одной итерации. По этой причине эпики нужно разбивать на наборы более мелких историй. Иногда эпики такие большие, что их приходится разбивать на ряд более мелких эпик, каждая их которых в свою очередь разбивается на истории, пока не будут получены истории, которые можно с уверенностью оценить, реализовать и протестировать в одной итерации."},"cards/Дерево-функций":{"title":"Дерево функций","links":[],"tags":[],"content":"Дерево функций (feature tree) представляет собой наглядную картину функций, объединенных в логические группы с иерархическим разбиением каждой функций на более мелкие. Дерево функций предоставляет сжатую иллюстрацию всех запланированных к реализации в проекте функций, что отлично подходит для показа топ-менеджерам, желающим увидеть общую картину всего проекта. Дерево функций может содержать до\nтрех уровней функций, которые обычно называют уровень 1 (L1), уровень 2 (L2) и уровень 3 (L3). Функции уровня L2 являются подфункциями L1, а функции L3 — подфункциями L2."},"cards/Диаграмма-деятельности":{"title":"Диаграмма деятельности","links":["cards/BABOK"],"tags":[],"content":"BABOK\nДиаграмма деятельности (Activity Diagram) – это одна из диаграмм\nпредставления вариантов использования (Use Case), определяемых в\nUML®. Изначально предназначавшуюся для детализации единичного\nварианта использования, диаграмму деятельности применяют для\nболее общих целей моделирования процессов, включая моделирование\nбизнес-процессов. Внешне сходная с блок-схемой, диаграмма\nдеятельности, как правило, использует дорожки для обозначения\nответственности, линии синхронизации для отображения параллельной\nобработки и точки принятия решений с множественными выходами.\nОсобенности использования\n.1 Преимущества\n• Обращается к базовому человеческому пониманию последовательных\nдействий.\n• Большинство заинтересованных сторон не испытывает затруднений с\nпонятиями и основными элементами модели процесса.\n• Используя уровни, можно представлять разные ракурсы различных\nзаинтересованных сторон.\n• Эффективно показывает управление большим количеством сценариев\nи параллельных ветвей.\n• Помогает выявлять группы заинтересованных сторон, которые иначе\nмогли бы быть упущены"},"cards/Диаграмма-состояний":{"title":"Диаграмма состояний","links":["cards/BABOK"],"tags":[],"content":"BABOK\nДиаграмма состояний показывает жизненный цикл одной сущности,\nначиная с ее первого появления и проходя через все различные\nсостояния, в которых сущность может находиться, до ее отбрасывания и\nпрекращения использования.\nСостояние на диаграмме состояний отображается в виде\nпрямоугольника с закруглёнными углами. На диаграмме может быть любое количество состояний. Сложное состояние можно\nдекомпозировать на под-состояния.\nПереход из одного состояния в другое отображается однонаправленной\nстрелкой, идущей от исходного состояния к целевому, на которой\nопционально может указываться имя события, вынуждающего сущность\nперейти из одного состояния, и опционально - условия перехода и\nсопутствующие действия.\nНачало и конец жизненного цикла сущности отображаются\nспециальными символами для исходного состояния, показывающего\nвозникновение сущности, и для конечного состояния, показывающего,\nчто сущность отбрасывается и жизненный цикл завершён."},"cards/Диаграммы-вариантов-использования":{"title":"Диаграммы вариантов использования","links":["cards/BABOK"],"tags":[],"content":"BABOK\nЦель — это краткое описание успешного результата варианта использования с точки зрения главного действующего лица, обобщающее вариант использования.\nМежду вариантами использования обычно используются два вида связей:\n\nРасширение (Extend): позволяет вставлять в вариант использования описание дополнительного поведения. Расширяемый вариант использования должен быть сам по себе полностью функциональным, и его успешное выполнение не должно зависеть от расширяющего варианта использования. С помощью этого вида связи можно показать, что в существующий вариант использования добавляется альтернативный поток (представляющий новые требования).\nВключение (Include): позволяет варианту использования использовать функциональность, представляемую другим вариантом использования. Включаемый вариант использования не обязан быть полным сам по себе, если он не инициируется напрямую действующим лицом. Этот тип связи чаще всего используется, когда некоторая общая функциональность нужна нескольким вариантам использования, либо для отделения сложной логической части.\n\nДействующее лицо - любые внешние по отношению к решению лица\nили системы, взаимодействующие с этим решением. Каждому\nдействующему лицу даётся уникальное имя, отражающее роль, которую\nоно играет при взаимодействии с решением. Некоторые подходы к\nнаписанию вариантов использования не рекомендуют использовать\nсистемы или события в качестве действующих лиц.\nДействующее лицо, инициирующее вариант использования, называется\nглавным для этого варианта использования. Прочие действующие лица,\nучаствующие в варианте использования во вспомогательной роли,\nназываются вторичными.\nВарианты использования и сценарии описывают, как человек или\nсистема взаимодействуют с моделируемым решением для достижения\nцели.\nВарианты использования описывают взаимодействия между главным\nдействующим лицом, решением и вторичными действующими лицами,\nнеобходимые для достижения цели главного действующего лица.\nВарианты использования обычно инициируются главным действующим\nлицом, но в некоторых случаях также могут инициироваться другой\nсистемой, внешним событием или таймером.\nВариант использования описывает возможные результаты попыток\nдостижения определенной цели, достижению которой способствует\nрешение. Он детализирует разные пути, которыми можно следовать,\nопределяя основной и альтернативные потоки. Основной, или базовый,\nпоток отражает кратчайший путь достижения цели варианта\nиспользования. Особые условия и исключения, в результате которых не\nудается достичь цель варианта использования, документируются в\nальтернативных потоках или потоках исключений. Варианты\nиспользования пишутся с точки зрения действующего лица и избегают\nописания внутренней работы решения.\nДиаграммы вариантов использования — это графическое\nпредставление связей между действующими лицами и одним или более\nвариантами использования, которые поддерживают решение.\nНекоторые подходы к вариантам использования различают бизнес-\nварианты использования и системные варианты использования, где\nбизнес-варианты использования описывают взаимодействие\nдействующих лиц с некоторым процессом или бизнес-функцией, а\nсистемные варианты использования описывают взаимодействие\nдействующего лица с программным обеспечением.\nСценарий описывает только один способ, с помощью которого\nдействующее лицо может достичь определённую цель. Сценарии\nзаписываются в виде серии шагов, выполняемых действующими лицами\nили решением, позволяющих действующему лицу достичь цели. Вариант\nиспользования описывает несколько сценариев.\nДиаграмма вариантов использования визуально изображает скоуп\nрешения, показывая какие действующие лица взаимодействуют с\nрешением, с какими вариантами использования они взаимодействуют, а\nтакже связи между вариантами использования. Унифицированный язык\nмоделирования (UML®) описывает стандартную нотацию диаграммы\nвариантов использования.\n\nоценить вероятность завершения сделки успехом\nклассифицировать источник лида (в т.ч. автоматическое завершение некачественных лидов)\nраспределение отвественных\nлидогенерация из различных источников\nвыделение компаний ВГР\nнакопление данных для отчетности\n\nb_crm_field_attr - таблица информация о полях в карточке сделки"},"cards/Диаграммы-перехода-состояний":{"title":"Диаграммы перехода состояний","links":["cards/BABOK"],"tags":[],"content":"BABOK"},"cards/Диаграммы-последовательности":{"title":"Диаграммы последовательности","links":["cards/BABOK"],"tags":[],"content":"BABOK\nДиаграммы последовательности используются для моделирования\nлогики сценариев использования, показывая обмен информацией\nмежду объектами системы в ходе выполнения сценария.\nДиаграмма последовательности показывает, как процессы или объекты\nвзаимодействуют в ходе сценария. Классы, необходимые для\nвыполнения сценария, и сообщения, которые они передают друг другу\n(инициируемые шагами варианта использования), отображаются на\nдиаграмме. Диаграмма последовательности показывает, как\nиспользуемые в сценарии объекты взаимодействуют, но не то, как они\nсвязаны друг с другом. Диаграммы последовательности также часто\nиспользуются для иллюстрации взаимодействия компонентов\nпользовательского интерфейса или компонентов программного\nобеспечения.\nЭта диаграмма отображает информацию, организованную\nгоризонтально и вертикально. Объекты, которые отправляют\nсообщения друг другу, представлены в виде блоков, которые\nвыровнены в верхней части страницы слева направо, причем каждый\nобъект занимает столбец на странице, ограниченный вертикальной\nлинией, идущей вниз до нижней части страницы. Посылаемые от\nодного объекта к другому сообщения показываются горизонтальными\nстрелками. Порядок сообщений показывается в последовательности\nсверху вниз и слева направо, начиная с первого сообщения в верхнем\nлевом углу страницы и последующих сообщений, появляющихся справа и снизу. Диаграммы\nпоследовательности иногда называют диаграммами событий.\nСтандартная нотация диаграмм последовательности определяется как\nчасть спецификации языка UML® (Unified Modelling Language™)."},"cards/Документ-о-концепции-и-границах-проекта":{"title":"Документ о концепции и границах проекта","links":["cards/Пользовательская-история"],"tags":[],"content":"Рекомендуемая структура и содержание документа\n1. Бизнес-требования\n1.1 Исходные данные\nCуммируют обоснование и содержание нового продукта или изменения, которые  нужно  внести  в  существующий  продукт.  Здесь  помещают  общее описание предыстории или ситуации, в результате чего было принято решение о создании продукта.\nДля наполнения раздела может быть использована Пользовательская история бизнес-потребности.\n1.2 Возможности бизнеса\nОписывается  бизнес-задачи, которые  решаются  посредством  реализации проекта,  или  бизнес-процессы,  для улучшения которых требуется проект, а также среду, в которой система будет использоваться.\n1-й уровень дерева\n1.3 Бизнес-цели\nСуммирует  важные  преимущества  бизнеса,  предоставляемые  продуктом,  в\nколичественном и измеряемом виде\n2-й уровень дерева\nпримеры\nУвеличить производительность обработки\nтранзакций на X% и снизить уровень ошибок\nданных до величины не более Y%\nУменьшить время выполнения заявки до X\nчасов на Y% звонков в службу поддержки\n1.4 Критерии успеха\nОпределите, как заинтересованные лица будут определять и измерять успех\nпроекта (Wiegers, 2007). Установите факторы, которые максимально влияют\nна успех проекта — те, которые организация может контролировать, и те, ко-\nторые находятся вне сферы ее влияния.\n3-й уровень дерева\n1.5 Положение о концепции проекта\nДалее показан шаблон, состоящий из ключевых слов, которые\nпрекрасно подходят для документа о концепции продукта (Moore, 1991):\n•  Для [целевая аудитория покупателей];\n•  Который [положение о потребностях или возможностях];\n•  Эта (этот) [имя продукта];\n•  Является [категория продукта];\n•  Который(ая)  [основные  функции,  ключевое  преимущество,  основная\nпричина для покупки или использования];\n•  В отличие от [основной конкурирующий продукт, текущая система или\nтекущий бизнес-процесс];\n•  Наш продукт [положение об основном отличии и преимуществе нового\n1.6 Бизнес-риски\n1.7 Предположения и зависимости\nПредположение (assumption) — это утверждение, которое предполагается верным в отсутствие знаний или доказательств иного. Бизнес-предположения\nтесно связаны  с  бизнес-требованиями.\nЗадокументируйте  все  предположения,  сделанные  заинтересованными лицами, когда они обдумывали проект и создавали данный документ о концепции и границах. Часто предположения одних лиц не разделяют другие стороны. Если вы запишите их и просмотрите позже, то избежите возможной путаницы и ухудшения ситуации в будущем.\nЗадокументируйте важнейшие зависимости проекта от внешних факторов — изменения отраслевых стандартов или предписаний регулирующих органов, других проектов, сторонних поставщиков или партнеров по разработке.\n2. Рамки и ограничения проекта\n2.1 Основные функции\nОпишите основные функции проекта или возможности пользователей. Подумайте, как пользователи будут работать с этими функциями, чтобы убедиться, что список функций полон и не содержит ненужных функций, которые интересны, но не приносят пользы\nпользователям.  Назначьте  каждой  функции  уникальное  и  постоянное  название, чтобы ее можно было отслеживать в других компонентах системы. Можно создать древовидную схему.\n2.2 Объем первоначально запланированной версии\nОбобщает  основные  запланированные  функции,  включенные  в  первоначальную  версию  проекта.  Границы  проекта  обычно  определяются  как  набор  функций,  но  их  можно  также  определять  в  терминах  пользовательских историй,  вариантов  использования,  потоков  вариантов  использования  или внешних  событий.\nТакже  можно  описать  характеристики  качества,  которые позволят проекту предоставлять  предполагаемые  преимущества  различным классам пользователей. Если ваша задача — сосредоточиться на разработке и уложиться в график, вам следует избегать искушения включить в версию 1.0 каждую функцию, которая когда-нибудь в будущем может понадобиться какому-то потенциальному покупателю. Сосредоточьтесь на наиболее ценных функциях, имеющих максимально приемлемую стоимость, годных для самой широкой целевой аудитории, которые удастся создать как можно раньше.\n2.3 Объем последующих версий\nЕсли вы ожидаете поэтапную эволюцию проекта или если используете итеративную модель разработки, создайте план выпуска, в котором укажите, какие функции будут отложены и желательные сроки последующих выпусков.\nВ последующих версиях вы сможете реализовать дополнительные варианты\nиспользования  и  функции  и  расширить  возможности  первоначальных  вариантов использования и функций. Чем дальше вы заглядываете, тем более расплывчатыми будут границы проекта. Вам наверняка придется передвинуть  функциональность  с  одного  запланированного  выпуска  до  другого  и, возможно, добавлять незапланированные функции. Короткие циклы выпусков часто предоставляют удобные случаи для накопления знаний, основанных на отзывах клиентов.\n2.4 Ограничения и исключения\nПеречислите все возможности или характеристики, которых могут ожидать заинтересованные в проекте лица, но включение которых в продукт или в определенную  версию  не  запланировано.  Перечислите  изъятые  элементы, чтобы не забыть решения по границам проекта.\n3. Бизнес-контекст\n3.1 Профили заинтересованных лиц\nПрофили заинтересованных лиц описывают различные категории клиентов и других ключевых лиц, заинтересованных в этом проекте. Вам не нужно описывать каждую группу заинтересованных лиц, например юристов, которые должны проверять соответствие\nнадлежащим  законам.\nСферой  вашего  интереса  должны  стать  различные группы клиентов, целевые рыночные сегменты и различные классы пользователей, входящих в эти сегменты. В профиль каждого заинтересованного в проекте лица включается следующая информация:\n\nосновная  ценность  или  преимущество,  которое  продукт  принесет  заинтересованным лицам, и то, как продукт удовлетворит покупателей. Ценность для заинтересованных лиц представляют:\n\nповышенная производительность;\nменьшее количество переделок;\nснижение себестоимости;\nускорение бизнес-процессов;\nавтоматизация задач, ранее выполнявшихся вручную;\nвозможность выполнять совершенно новые задачи;\nсоответствие соответствующим стандартам и правилам;\nлучшая, по сравнению с текущими продуктами, легкость и простота использования;\n\n\nих вероятное отношение к продукту;\nсамые важные для них функции и характеристики;\nвсе известные ограничения, которые должны быть соблюдены.\n\nМожно  включить  поименный  список  ключевых  заинтересованных  лиц\nдля каждого профиля или структурную схему организации, показывающую\nотношения между заинтересованными лицами в организации.\n3.2 Приоритеты проекта\nЧтобы  принимать  эффективные  решения,  заинтересованные  лица  должны договориться о приоритетах проекта. Один из подходов к этому заключается в рассмотрении пяти измерений: функции (или объем), качество, график, затраты и кадры. В любом проекте каждое из этих измерений относится к одной из трех категорий:\n\nограничение — сдерживающий фактор, в рамках которого должен оперировать менеджер проекта;\nведущий фактор — важный фактор успеха, ограниченно гибкий при изменениях;\nстепень свободы — возможность для менеджера проекта до определенной степени менять измерение и балансировать относительно других измерений.\n\nЗадача менеджера проекта — скорректировать те факторы, которые представляют собой степени свободы для достижения ключевых факторов успеха проекта в рамках, налагаемых ограничениями\nВнимание!  Не все пять измерений могут быть ограничениями, и они не могут быть\nведущими  факторами.  Менеджеру  проекта  нужна  определенная  степень  свободы,\nчтобы иметь возможность реагировать при изменении требований или обстоятельств\nпроекта."},"cards/Карта-экосистемы":{"title":"Карта экосистемы","links":["cards/Контекстная-диаграмма"],"tags":[],"content":"Карта  экосистемы  (ecosystem  map)  показывает  все  системы,  связанные  с создаваемой системой и взаимодействующие друг с другом, а также природу этих взаимодействий. Карта экосистемы представляет рамки путем отображения всех систем, которые взаимосвязаны друг с другом и которые может потребоваться изменить при создании вашей системы. Карта экосистемы отличается от контекстных диаграмм  тем, что показывает другие системы, связанные с создаваемой вами, в том числе без непосредственных интерфейсов. Зависимые системы можно определить путем выявления тех, что потребляют данные, поступающие из вашей системы. Когда вы достигнете точки, в которой ваш проект не влияет ни на какие дополнительные данные, можно сказать, что вы достигли границы систем, которые\nотносятся к решению."},"cards/Классификация-требований":{"title":"Классификация требований","links":["posts/План-составления-бизнес-требований"],"tags":[],"content":"\nБизнес-требования: формулировка целей, задач и результатов, которые описывают, почему изменение было инициировано. Они могут относиться к предприятию в целом, области бизнеса или конкретной инициативе (см. План составления бизнес-требований).\nТребования заинтересованной стороны: описывают потребности заинтересованных сторон, которые необходимо удовлетворить, чтобы выполнить бизнес-требования. Они могут служить мостом между бизнес-требованиями и требованиями к решению.\nТребования к решению: описывают возможности и качества решения, отвечающего требованиям заинтересованных сторон. Они обеспечивают необходимый уровень детализации, позволяющий разработать и внедрить решение. Требования к решению можно разделить на две категории:\n\nФункциональные требования: описывают возможность, которой должно обладать решение с точки зрения поведения и информации, с которой решение будет работать,\nНефункциональные требования или требования к качеству сервиса: не относятся напрямую к поведению функциональности решения, а скорее описывают условия, при которых решение должно оставаться действенным, либо качества, которыми оно должно обладать.\n\n\nПереходные требования (требования переходного периода): описывают возможности, которыми должно обладать решение, или условия, которым оно должно соответствовать, чтобы обеспечить переход из текущего состояния в будущее. Необходимость в таких требованиях отпадает после завершения изменения. Они отличаются от других видов требований тем, что имеют временный характер. Переходные требования решают такие вопросы, как конвертация данных, обучение, обеспечение непрерывности бизнеса.\n"},"cards/Контекстная-диаграмма":{"title":"Контекстная диаграмма","links":[],"tags":[],"content":"Уточнение  рамок  определяет  границу  и  связи  разрабатываемой  системы  со всем остальным миром. Контекстная диаграмма (context diagram) графически иллюстрирует эту границу. Она определяет оконечные элементы (terminators), расположенные вне системы, которые определенным образом взаимодействуют с ней, а также данные, элементы управления и материальные потоки, протекающие между оконечными элементами и системой. Контекстная диаграмма представляет собой высший уровень абстракции в диаграмме потока данных"},"cards/Критерии-верификации-требований":{"title":"Критерии верификации требований","links":[],"tags":[],"content":"\nАтомарность: самодостаточны и понятны независимо от других требований или дизайнов.\nПолнота: достаточны для ведения дальнейшей работы и имеют должный уровень детализации для продолжения работы. Требуемый уровень полноты варьируется в зависимости от ракурса или методологии, а также от точки жизненного цикла, в которой требование анализируется или представляется.\nСогласованность: соответствуют выявленным потребностям заинтересованных сторон и не конфликтуют с другими требованиями.\nКраткость: не содержат посторонних и ненужных сведений.\nВыполнимость: разумны и реализуемы в рамках согласованного риска, графика и бюджета, либо достаточно осуществимы для дальнейшего исследования через эксперименты или прототипы.\nОднозначность: требование должно быть ясно сформулировано так, чтобы было очевидно, удовлетворяет ли решение соответствующую потребность или нет.\nТестируемость: возможность проверить выполнение требования или дизайна. Приемлемые уровни проверки выполнения зависят от уровня абстракции требования или дизайна.\nПриоритезируемость: оцениваются, группируются или обсуждаются в терминах важности и ценности по сравнению с другими требованиями.\nПонятность: представлены с использованием общей терминологии, используемой данной аудиторией.\n\n"},"cards/Модель-цепочки-создания-ценности-Портера":{"title":"Модель цепочки создания ценности Портера","links":["cards/Атрибуты-ценности"],"tags":[],"content":"\nКомпания производит товар или услугу.\nЦелью деятельности компании является получение прибыли от реализации товара / услуги.\nЦенностью считается действие, увеличивающее прибыль компании.\nУвеличение прибыли возможно за счет воздействия на процессы компании.\nВ каждой компании существуют процессы двух типов:\n\nОсновные процессы:\n\nВходящая логистика. Все действия, необходимые для получения, хранения и распределения ресурсов на входе. Включает в себя отношения с поставщиками.\nОперационная деятельность. Все действия, необходимые для преобразования входов в выходы.\nИсходящая логистика. Все действия, необходимые для сбора, хранения и распределения выходов.\nМаркетинг и продажи. Действия по информированию покупателей о товарах и услугах, привлечению покупателей и содействию покупке.\nСервис и поддержка. Все действия, обеспечивающие  функционирование товара или использование услуги покупателем после их приобретения.\n\n\nВспомогательные процессы:\n\nЗакупки. Приобретение входящих ресурсов.\nУправление человеческими ресурсами. Все действия, связанные с подбором, наймом, обучением, развитием, компенсацией и (при необходимости) сокращением и увольнением персонала.\nТехнологическое развитие. Оборудование, техника, программное обеспечение, процедуры и технические знания, используемые для преобразования входов в выходы.\nИнфраструктура. Обслуживает потребности организации и связывает ее части воедино. Состоит из таких подразделений или функций, как бухгалтерия, юристы, финансы, планирование, связи с общественностью, связи с государственными органами, контроль качества и дирекция.\n\n\n\n\n\nЦенность характеризуется атрибутами (см. Атрибуты ценности)"},"cards/Оценка-решения":{"title":"Оценка решения","links":["cards/BABOK","theory/Компетенции-бизнес-анализа","cards/Рекомендация-действий-по-увеличению-ценности-решения","cards/BACCM"],"tags":[],"content":"BABOK Компетенции бизнес-анализа\nЗадачи области знания “Оценка решения” могут выполняться применительно к компонентам решения на различных стадиях разработки:\n\nПрототипы или Подтверждения концепции: работающие, но ограниченные версии решения, демонстрирующие ценность.\nПилотные или Бета релизы: ограниченные реализации или версии решения, используемые для проработки проблем и понимания того, насколько оно на самом деле приносит пользу, прежде чем полностью выпускать решение.\nОперационные выпуски: полные версии частичного или завершенного решения, используемого для достижения бизнес-целей, выполнения процесса, или получения желаемого результата.\n\nЗадачи:\n\nИзмерение эффективности решения: определяет наиболее подходящий способ оценки эффективности решения, включая то, как оно согласуется с целями и задачами компании, и выполняет эту оценку.\nАнализ показателей эффективности: изучает информацию относительно эффективности решения для понимания пользы, приносимой им предприятию и заинтересованным сторонам, и определяет, удовлетворяет ли оно текущие потребности бизнеса.\nОценка ограничений решения: исследует проблемы, входящие в скоуп решения, способные помешать ему удовлетворить текущие потребности бизнеса.\nОценка ограничений предприятия: исследует находящиеся за рамками решения проблемы, могущие помешать предприятию полностью реализовать ценность, которую решение способно принести.\nРекомендация действий по увеличению ценности решения: выявляет и определяет действия, которые предприятие может выполнить для увеличения пользы, приносимой решением.\n\nСвязь базовых понятий BACCM и действий аналитика\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nБазовое понятиеДействие аналитикаИзменение: акт преобразования в ответ на потребность.рекомендуют изменение решения или предприятия для реализации потенциальной ценности решения.Потребность: проблема или возможность, подлежащая рассмотрению.оценивают то, насколько решение или компонент решения удовлетворяет потребностьРешение: конкретный способ удовлетворения одной или более потребностей в данном контексте.оценивают эффективность решения, проверяют, приносит ли оно возможную пользу, и анализируют, почему решение или компонент решения может не приносить пользу.Заинтересованная сторона: лицо или группа лиц, имеющие отношение к изменению, потребности или решению.выясняют у заинтересованных сторон информацию об эффективности решения и поставляемой ценности.Ценность: стоимость, важность или полезность чего-либо для заинтересованной стороны в данном контексте.определяют, приносит ли решение возможную пользу и исследуют, почему польза может не быть реализована.Контекст: обстоятельства, влияющие на изменение, затрагиваемые им, или обеспечивающие его понимание.учитывают контекст при определении мер эффективности решения и ограничений внутри контекста, способных помешать реализации ценности."},"cards/Пользовательская-история":{"title":"Пользовательская история","links":[],"tags":[],"content":"Пользовательская история представляет собой небольшую сжатую формулировку функциональности или качества, необходимых конкретной заинтересованной стороне для получения пользы.\nПользовательские истории фиксируют потребности конкретной заинтересованной стороны и позволяют командам определять ценные для заинтересованной стороны свойства, используя краткую простую документацию.  Она могут служить основой для выявления потребностей, а также позволяют приоритизировать, оценивать и планировать решения.\nОбычно пользовательская история — это несколько предложений, описывающие, кто имеет рассматриваемую историей потребность, цель, которую пользователь пытается достичь, и любую дополнительную информацию, критичную для понимания содержания истории.\nДля пользовательских историй не существует обязательной структуры.\nНаиболее популярный формат включает три компонента:\n• Кто: пользовательская роль или персона.\n• Что: требуемое действие, поведение, функция или качество.\n• Почему: выгода или ценность, получаемые пользователем при реализации истории."},"cards/Рекомендация-действий-по-увеличению-ценности-решения":{"title":"Рекомендация действий по увеличению ценности решения","links":["cards/BABOK","cards/Оценка-решения"],"tags":[],"content":"BABOK Оценка решения\n\nНе делать ничего: обычно рекомендуется при низкой ценности изменения в сравнении с усилиями, необходимыми для выполнения изменения, или когда связанные с изменением риски значительно перевешивают риски пребывания в текущем состоянии. Также может быть невозможно внести изменения с использованием доступных ресурсов или в течение выделенного периода времени.\nОрганизационные изменения: это процесс управления отношениями, восприятием и участием в изменениях, связанных с реализацией решения. Под управлением организационными изменениями обычно понимается процесс и набор инструментов управления изменениями на некотором организационном уровне. Бизнес-аналитик может помочь разработать рекомендации по изменениям организационной структуры или персонала, поскольку должностные функции могут значительно измениться. Заинтересованным сторонам может стать доступна новая информация, и для работы с решением могут потребоваться новые навыки.\n\nавтоматизацию или упрощение работы, которую выполняют люди. Сравнительно простые задачи - идеальные кандидаты для автоматизации. Кроме того, рабочие действия и бизнес-правила можно рассматривать и анализировать на предмет возможности реинжиниринга, изменения обязанностей или аутсорсинга.\nулучшение доступа к информации. Изменение может давать персоналу и лицам, принимающим решения, информацию большего объема или лучшего качества.\n\n\nУменьшение сложности интерфейсов: интерфейсы необходимы всякий раз, когда работа передается между системами или между людьми. Уменьшение их сложности может улучшить понимание.\nУстранение избыточности: различные группы заинтересованных сторон могут иметь общие потребности, которые можно удовлетворить одним решением, уменьшая тем самым стоимость реализации.\nПредотвращение потерь: цель - устранить не добавляющие ценность действия и минимизировать действия, не вносящие прямой вклад в конечный продукт.\nОпределение дополнительных возможностей: варианты решения могут предлагать организации возможности сверх и помимо тех, которые определены в требованиях. Во многих случаях эти возможности не имеют сиюминутной ценности для организации, но могут обеспечить будущую ценность, поскольку решение может поддерживать быструю разработку или реализацию этих возможностей, если они необходимы (например, программное приложение может иметь функции, которые организация предполагает использовать в будущем).\nВывод решения из эксплуатации: может понадобиться рассмотреть замену решения или компонента решения. Это может произойти из-за того, что технологии достигли конца своего срока службы, услуг предоставяются по инсорсинга или аутсорсинга , либо потому, что решение не достигает целей, для которых оно было создано.\n\n"},"cards/Список-событий":{"title":"Список событий","links":["cards/Контекстная-диаграмма","cards/Карта-экосистемы"],"tags":[],"content":"Список  событий  (event  list)  перечисляет  внешние  события,  которые  могут инициировать определенное поведение в системе. Список событий определяет  границы  системы  путем  перечисления  возможных  бизнес-событий, инициируемых пользователями или инициируемых временем (срабатывание по времени), или сигналов от внешних компонентов, таких как аппаратные устройства. В списке находятся только названия событий — функциональные требования, описывающие, как система реагирует на события, должны\nописываться в спецификации SRS с использование таблиц событий и  реакций на них.\nСписок  событий  дополняет контекстную  диаграмму и карту экосистемы.\nКонтекстная диаграмма и карта экосистемы в совокупности описывают внешних действующих лиц и задействованные системы, а список событий определяет, как эти действующие лица и системы могут вызвать определенное поведение в создаваемой системе.\nСписок событий можно сверить на предмет корректности и полноты с контекстной диаграммой и картой экосистемы следующим образом:\n\nОпределите, какие внешние сущности в контекстной диаграмме могут являться источниками событий\nПосмотрите, нет ли в карте экосистемы системы, которая может инициировать события в вашей системе.\nДля  каждого  события  определите,  если  соответствующие  ему  внешние сущности в контекстной диаграмме или системы в карте экосистемы:\n"},"cards/Трассировка-требований":{"title":"Трассировка требований","links":["cards/BABOK"],"tags":[],"content":"BABOK\nЦель трассировки требований - обеспечивать соответствие друг другу требований и дизайнов на разных уровнях, а также контролировать влияние изменений на связанные требования на одном уровне.\nТрассировка требований определяет и документирует происхождение каждого требования, включая его обратную и прямую трассировку и его отношения к другим требованиям. Трассировка помогает убедиться в том, что решение соответствует требованиям и помогает управлять его скоупом, изменениями, рисками, временем, стоимостью и коммуникациями. Она также используется для обнаружения недостающей функциональности или уже реализованной функциональности, но не поддерживаемой существующими требованием.\nРезультат трассировки требований:\n\nТребования (трассированные): имеют ясно определенные отношения с другими требованиями, компонентами решения, его релизами, фазами или итерациями в пределах скоупа решения. Эти отношения проясняют покрытие и влияние изменений.\nДизайны (трассируемые): имеют ясно определенные отношения с другими требованиями, компонентами решения, его релизами, фазами или итерациями в пределах скоупа решения. Эти отношения проясняют покрытие и влияние изменений.\n"},"cards/Управление-жизненным-циклом-требований":{"title":"Управление жизненным циклом требований","links":["cards/BABOK","theory/Компетенции-бизнес-анализа","cards/Классификация-требований","cards/Трассировка-требований","cards/BACCM"],"tags":[],"content":"BABOK Компетенции бизнес-анализа  Классификация требований\n\nТрассировка требований: анализирует и поддерживает отношения между требованиями, дизайнами, компонентами решения и другими рабочими продуктами для проведения анализа влияния, покрытия и размещения.\nПоддержание требований: обеспечивает правильность и актуальность требований и дизайнов в течение жизненного цикла и помогает их использовать повторно там, где это уместно.\nПриоритизация требований: оценивает пользу, срочность и риски, связанные с конкретными требованиями и дизайнами, чтобы убедиться, что работа по анализу и/или поставке решения в каждый момент времени ведется над самыми важными из них.\nОценка изменений требований: оценивает новые и изменяющиеся требования заинтересованных сторон для определения необходимости их отработки в рамках изменения.\nОдобрение требований: работа с заинтересованными сторонами, вовлеченными в процесс управления, для достижения одобрения и согласия относительно требований и дизайнов.\n\nСвязь базовых понятий BACCM и действий аналитика\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nБазовое понятиеДействие аналитикаИзменение: акт преобразования в ответ на потребность.управляют оценкой предлагаемых изменения требований и дизайнов в течение инициативы.Потребность: проблема или возможность, подлежащая рассмотрению.трассируют, приоритизируют и поддерживают требования в актуальном состоянии, чтобы гарантировать удовлетворение потребностей.Решение: конкретный способ удовлетворения одной или более потребностей в данном контексте.трассируют требования и дизайны к компонентам решения, с целью убедиться, что решение удовлетворяет потребности.Заинтересованная сторона: лицо или группа лиц, имеющие отношение к изменению, потребности или решению.взаимодействуют с ключевыми заинтересованными сторонами для поддержания понимания, договоренностей и одобрения требований и дизайновЦенность: стоимость, важность или полезность чего-либо для заинтересованной стороны в данном контексте.поддерживают повторное использование требований для распространения их ценности за пределы текущей инициативыКонтекст: обстоятельства, влияющие на изменение, затрагиваемые им, или обеспечивающие его понимание.анализируют контекст для поддержки задач трассировки и приоритизации."},"cards/Цели-вариантов-решения":{"title":"Цели вариантов решения","links":["cards/BABOK","cards/Анализ-требований-и-определение-дизайна"],"tags":[],"content":"BABOK Анализ требований и определение дизайна\n\nПовышение эффективности: автоматизация или упрощение выполняемой людьми работы, достигаемые за счет реинжиниринга или совместного использования процессов, изменения обязанностей или аутсорсинга. Автоматизация может также повысить согласованность поведения, уменьшая вероятность выполнения различными заинтересованными сторонами одной и той же функции совершенно разными способами.\nУлучшение доступа к информации: предоставление большего количества информации сотрудникам, прямо или косвенно взаимодействующим с клиентами, снижая таким образом потребность в специалистах.\nОпределение дополнительных возможностей: выделение возможностей, которые могут принести пользу в будущем и могут поддерживаться решением. Эти возможности не обязательно имеют непосредственную ценность для организации (например, программное приложение со свойствами, которые организация ожидает использовать в будущем).\n"},"cards/Что-нужно-помнить-при-составлении-требований":{"title":"Что нужно помнить при составлении требований","links":[],"tags":[],"content":"\nвсе требования должны быть согласованы и не должны противоречить друг другу (трассировка требований)\nтребования со временем могут изменятся и важно не только поддерживать их актуальное состояние, но и хранить историю изменений (поддержание требований)\nтребования имеют различные пользу, срочность и риски, которые со временем могут изменяться. Важно, чтобы в каждый момент времени работа велась над выполнением требований с наивысшим приоритетом (приоритезация требований)\n"},"cases/Задокументировать-поля-карточки-сделки":{"title":"Задокументировать поля карточки сделки","links":["tags/Битрикс24"],"tags":["Битрикс24"],"content":"Битрикс24\nЧто и зачем нужно документировать\nВ карточку сделки выводятся поля для заполнения и отображения информации о сделке. Поля группируются по разделам и имеют различные настройки, например, обязательность заполнения на определенных стадиях, или ограничение видимости для отдельных пользователей. Все перечисленное является частью пользовательского интерфейса.\n\n[!Документирование и поддержание а актуальном состоянии внешнего вида и поведения интерфейса пользователя - одна из задач аналитика Битрикс24.]\n\nДля описания полей в карточке сделки в документации наиболее часто фиксируют следующую информацию:\n\nназвание поля\nуникальный идентификатор\nтип данных\nвидимость поля - поле видно всегда или только в том случае, если оно заполнено\nобязательность ввода данных на определенных стадиях\nограничение видимости поля для отдельных пользователей и групп\n\nКогда полей в карточке немного и изменяются они относительно редко - ручное документирование полей не составляет проблемы. Но если на портале:\n\nнесколько направлений сделок,\nв каждом направлении настроено несколько видов карточек для различных групп пользователей,\nкаждый вид карточки включает 3-4 десятка полей,\nто без автоматического сбора информации не обойтись.\n\nОткуда получать информацию о полях в карточке сделки\nВ Битрикс24 существует несколько типов настроек карточки сделки\n\nобщий вид карточки сделки\nдля заданной группы пользователей\nперсональный вид карточки пользователя\n\nЕсли говорить о последнем, документировать персональные настройки карточки сделки пользователей вряд ли имеет смысл, поэтому укажем лишь, что\n\nдля получения информации можно воспользоваться REST API методом crm.item.details.configuration.get. В параметрах запрос указать id пользователя и id воронки. В ответе получим:\n\nуникальный идентификатор полей с привязкой к разделам карточки сделки\nнастройку видимости полей - всегда отображается или только если заполнено данными\n\n\nсами данные находятся в системной таблице __\n\n\n\n                  \n                  Danger\n                  \n                \n\n\nгде находится общий вид карточки сделки\nнастройки пользователей можно распарсить через скрипт?\n\n\n\nb_ui_entity_editor_config\nENTITY_TYPE_ID = deal_details_c_NN\nполучить информацию о карточе сделки\nвариант 1 # crm.item.details.configuration.get\n??? ограничения - для пользователя ????"},"cases/Как-документировать-роботов-в-воронках":{"title":"Как документировать роботов в воронках","links":["tags/Битрикс24"],"tags":["Битрикс24"],"content":"Битрикс24"},"index":{"title":"Публикации","links":["posts/Определение-стратегии-реализации-проекта","posts/С-чего-начинать-новый-проект-внедрения-автоматизации","posts/Анализируем-бизнес-требования","posts/План-составления-бизнес-требований","posts/Составляем-документ-о-концепциях-и-границах"],"tags":[],"content":"Серия публикаций …\nНа примере практического кейса рассмотрена последовательность действий бизнес-аналитика по внедрению Битрикс24 в бизнес-процессы компании. В публикациях приведены теоретические сведения, примеры вариантов решения и рекомендации. Несмотря на специфику области применения - использование Битрикс24 как инструмента автоматизации, в публикациях сохранен общий рекомендуемый подход к работе бизнес-аналитика над проектом.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nОпределение стратегии реализации проектаС чего начинать новый проект внедрения автоматизацииАнализируем бизнес-требованияПлан составления бизнес-требованийСоставляем документ о концепциях и границах"},"life_hack/Получить-информацию-о-полях,-выведенных-в-карточку-сделки":{"title":"Получить информацию о полях, выведенных в карточку сделки","links":[],"tags":[],"content":"Персональный вид карточки пользователя\nТаблица b_user_option\nфильтр по NAME = deal_details_c_NN\nгде NN - ID воронки\nбудет выведен список записей с настройками персональных видок карточек для пользователей которые их настроили\nВид карточки для групп пользователей\nТаблица b_ui_entity_editor_config\nфильтр по ENTITY_TYPE_ID = deal_details_c_NN\nгде NN - ID воронки\n\nпо моему по умолчанию (общий вид карточки) будет в записи для которой поле AUTO_APPLY_SCOPE=Y\n\n\n\n\n\n\n\n\n\n\n\n\n\nGTTYHJJKHK518"},"life_hack/Получить-исторические-данные-по-сущностям":{"title":"Получить исторические данные по сущностям","links":[],"tags":[],"content":"Основные таблицы описывающие действия пользователей:\n\nb_crm_deal_stage_history\nb_crm_event\nb_crm_event_relations\nb_crm_timeline\n"},"life_hack/Посмотреть-процент-заполнения-полей":{"title":"Посмотреть процент заполнения полей","links":[],"tags":[],"content":"Таблица # b_uts_crm_deal\nмтс лайф"},"posts/Анализируем-бизнес-требования":{"title":"Анализируем бизнес-требования","links":["cards/Цели-вариантов-решения"],"tags":[],"content":"Определение вариантов решения: выявление, изучение и описание различных возможных путей удовлетворения потребности бизнеса. Цели вариантов решения\nАнализ потенциальной ценности и рекомендация решения: оценка бизнес-ценности, связанной с потенциальным решением и сравнение различных вариантов, включая компромиссы, для определения и рекомендации варианта решения, приносящего наибольшую общую пользу.\nmm"},"posts/Определение-стратегии-реализации-проекта":{"title":"sss.html","links":["cards/Пользовательская-история","posts/С-чего-начинать-новый-проект-внедрения-автоматизации","cards/Модель-цепочки-создания-ценности-Портера","cards/Атрибуты-ценности","posts/Составляем-документ-о-концепциях-и-границах"],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nДля чего:согласовать с клиентом этапы, последовательность и сроки выполнения работВходная информация:бизнес-потребности клиентаВыходная информация:пользовательская история, дорожная карта проекта, бэклогПрименяемые техники:Пользовательская история\n\nИсходной информацией для начала работы над любым проектом являются потребности бизнеса (см. Кейс). Потребность определяется проблемой или возможностью, стоящей перед компанией.\nТеория\nДля того, чтобы было проще определить стратегию, бизнес-потребности оформляют в пользовательскую историю (см. Пользовательская история)\nСуществует две  “противоположные” стратегии.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nСтратегияФакторПредикативнаяАдаптивнаяОпределение решенияБизнес-ценности реализации проекта известны, необходимо определить решение до начала реализации проекта, чтобы максимизировать контроль и уменьшить рискиБизнес-ценности реализации проекта до конца не определены, необходимо быстрое достижение известной бизнес-ценности (MVP)Уровень формальностинеобходимо предварительное документирование и согласование решения перед началом работинформация будет собираться и фиксироваться через командное взаимодействие и обратную связьДействияНеобходимые действия определяются вначале, а затем разбиваются по задачамДействия разбиваются по итерациям, при планировании итерации определяются связанные с ней задачиВремяИзвестны конкретные сроки завершения проектаЗадачи выполняются итеративно\nЗатруднения при определении стратегии может вызвать анализ Бизнес-ценности проекта.\nРеализация проекта неизбежно вносит изменения в бизнес-процессы компании. Чтобы сформулировать бизнес-ценность этих изменений нужно:\n\nопределить на какую деятельность компании повлияет внедрение проекта (см. Модель цепочки создания ценности Портера)\nсформулировать в чем будет выражаться влияние\n\nДействия, вносящие изменения в бизнес-процессы и влияющие на бизнес-ценность могут быть двух типов:\n\nдействия, добавляющие ценность,\nдействия по контролю. Гарантируют,  что  процессы  не  выходят  за допустимые границы. Их цель - предотвращать,  обнаруживать  и минимизировать  операционные  риски  или  изменять  ход  процесса.\n\nОдним из способов выявить факторы роста ценности  - составить дерево факторов роста ценности из трех  уровней:  приоритеты  бизнеса,  целей  и  непосредственно  факторов\nроста  ценности.\nРазбор кейса\nВыявление заинтересованных лиц\nАнализируя потребности бизнеса (продажи линейки продуктов компании, работа с клиентской базой, оперативная и аналитическая отчетность) выделяем процессы компании, на которые повлияет наш проект:\n\nМаркетинг и продажи: информирование покупателей о товарах и услугах, привлечению покупателей и содействию покупке.\nИнфраструктура: планирование и анализ продаж\n\nЭта информация помогает нам сформировать круг заинтересованных лиц - отдел продаж, руководство компании, связанное с планированием и анализом продаж.\nПользовательская история\nИсходной информацией для подготовки пользовательской истории являются:\n\nпотребности бизнеса\nдополнительная информация от заинтересованных лиц, полученная по результатам установочных встреч, интервью, анализа нормативных документов компании, брифов.\nНа данном шаге составляется верхнеуровневая пользовательская история проекта:\n\nПолученная в результате пользовательская история может выглядеть примерно так:\n\nМенеджер по продажам:\n\nХочу минимизировать ручной ввод информации о сделке чтобы сократить время работы со сделкой и избежать ошибок ввода информации.\nХочу иметь возможность автоматически отправлять моим клиентам рассылку по акциям и скидкам, чтобы получать дополнительные лиды.\nХочу увеличить среднюю стоимость сделки, чтобы получать большую зарплату\n\n\nРуководитель отдела продаж:\n\nХочу оперативно получать актуальную информацию о текущих продажах чтобы управлять ими и составлять краткосрочные прогнозы.\nХочу контролировать соблюдение менеджерами скриптов обработки лидов и сделок, чтобы увеличить конверсию сделок.\nХочу автоматизировать расчет KPI менеджеров по продажам, чтобы не тратить время на расчет бонусной части зарплаты.\n\n\nРуководство компании:\n\nХочу сократить время заключения сделки, чтобы продавать больше.\nХочу автоматизировать составление аналитической отчетности по продажам, чтобы планировать работу компании и выявлять наиболее востребованные продукты.\nХочу автоматизировать отчетность по эффективности работы менеджеров, для принятия кадровых решений.\n\n\nОбщие бизнес-правила и границы проекта:\n\nПроект должен быть завершен в течении 4-х месяцев с даты начала реализации\nВсе бизнес-требования важны и должны быть реализованы\nПеред началом работ должно быть выполнено документирование бизнес-процессов компании. Они должны соответствовать внутренним регламентам и нормативным документам, а все изменения до начала реализации проекта должны быть согласованы с руководством компании.\n\n\n\nСоставленная пользовательская история содержит  необходимую информацию для формулирования целей проекта и определения его бизнес-ценностей.\nАнализ бизнес-ценностей проекта\nСначала сформулируем ожидаемые ценности от внедрения проекта (см. Атрибуты ценности)\nИсходя из функциональных возможностей Битрикс24, определим следующие ценности:\n\nМаркетинг и продажи:\n\nускорение бизнес-процесса продаж линейки товаров (добавление ценности)\nавтоматизация контроля выполнения скриптов продаж (контроль)\nавтоматизация расчета KPI менеджеров по продажам (контроль)\nавтоматизация рекламной рассылки по клиентской базе (добавление ценности)\n\n\nПланирование и анализ продаж:\n\nпредоставление актуальной оперативной отчетности о ходе продаж (добавление ценности)\nавтоматизация формирования аналитической отчетности по продажам (добавление ценности)\nавтоматизация эффективности работы менеджеров (контроль)\n\n\n\nНа основании сформулированных ценностей составим дерево факторов роста ценности проекта.\n\nЕсли у бизнеса есть понимание, какие влияющие факторы являются наиболее приоритетными, в колонку “факторы ценности” добавляют весовые коэффициенты, которые характеризуют важность каждого фактора.\nПусть в нашем примере у заинтересованных лиц не будет однозначного понимания о приоритетах факторов бизнес-ценности.\nРезультат\nДля подведения итогов, обратимся к составленной пользовательской истории\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nСтратегияФакторПредикативнаяАдаптивнаяОпределение решенияБизнес-ценности и факторы их роста известныУровень формальностиНеобходимо предварительное документирование и согласование решения перед началом работДействияОтсутствует приоритизация достижения всех поставленных целейВремяИзвестны примерные сроки завершения проекта\nНа основании полученных совокупных данных аналитиком должно быть принято решение о выборе стратеги реализации проекта.\nВ “чистом” виде скорее всего не подойдет ни одна из указанных стратегий потому что отсутствие приоритетов целей с учетом разработки / согласования документации до начала работ И ограниченными сроками реализации предполагает такую стратегию:\n“Сначала разрабатываем и согласовываем документацию (работает аналитик, команда разработки простаивает), а затем запускаем все разом задачи в работу (работает команда разработки, аналитик простаивает).”\nЭто плохая стратегия:\n\nсогласование документации может занять продолжительное время, на разработку останется мало времени - есть риск не уложиться в сроки реализации проекта,\nпридется сдавать весь проект целиком в конце срока реализации, если в ходе согласования документации возникло ее скрытое разночтение (клиент понял по другому) или бизнес-цели клиента к тому времени изменились - есть риск неудовлетворенности клиента, он будет считать что проект успешно не реализован, поскольку не соответствует его бизнес-целям\nресурсов команды разработки как правило ограничены - также есть риск не реализовать проект в установленные сроки.\n\nРекомендуемая последовательнось действий в данной ситуации:\n\nсобрать верхнеуровневые бизнес-требования\nразбить бизнес-требования на группы (эпики) с учетом времени их реализации в Битриск24\nСоставить и согласовать последовательность реализации, начиная от самой простой и быстро реализуемой группы бизнес-требований.\n\nСледующий шаг - Составляем документ о концепциях и границах"},"posts/План-составления-бизнес-требований":{"title":"План составления бизнес-требований","links":["posts/Определение-стратегии-реализации-проекта","posts/Составляем-документ-о-концепциях-и-границах","cards/Классификация-требований","cards/Что-нужно-помнить-при-составлении-требований","cards/Критерии-верификации-требований"],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nДля чего:сформулировать этапы и последовательность составления бизнес-требований проектаПредыдущий шагОпределение стратегии реализации проектаВходная информация:User story бизнес-потребности, дорожная карта, бэклогВыходная информация:план составления бизнес-требованийПрименяемые техники:Следующий шагСоставляем документ о концепциях и границах\n\nТеория\nПри составление бизнес-требований важно понимать, чем они отличаются от других типов (см. Классификация требований) и не смешивать их. Второй важный момент, который постоянно нужно держать в голове - это свойства требований (см. Что нужно помнить при составлении требований), которые помогут облегчить управление их жизненного цикла.\nПри составлении бизнес-требований может потребоваться решение следующих задач:\n\nсбор информации для описания требований - контекст и границы проекта, классы пользователей проекта, пользовательские требования, системные события и реакцию на них\nспецификация требований - это подробное описание каждого требования.\nвалидация требований - проверка того, что набор требований полезен для бизнеса и поддерживает цели и задачи организации.\nопределение архитектуры требований - структурирование всех требований  так, чтобы они поддерживали конечную бизнес-цель изменения и успешно работали как единое целое.\nверификация требований - это проверка того, что набор требований проработан достаточно детально для использования конкретной заинтересованной стороной, внутренне непротиворечив и высокого качества (см. Критерии верификации требований)\nтрассировка требований - обеспечивать соответствие друг другу требований на разных уровнях, а также контролировать влияние изменений на связанные требования на одном уровне.\n\nДля небольших проектов некоторые задачи могут быть пропущены или объединены.\nИ еще важно помнить, выполнение задач - это не последовательный а итеративный процесс. К выполненным задачам придется возвращаться по мере поступления новой информации"},"posts/Работа-бизнес-аналитика-с-точки-зрения-BABOK-Guide":{"title":"Работа бизнес-аналитика с точки зрения BABOK Guide","links":["cards/BABOK","cards/BACCM","theory/Компетенции-бизнес-анализа","cards/Управление-жизненным-циклом-требований","Анализ-стратегии","cards/Анализ-требований-и-определение-дизайна","cards/Оценка-решения"],"tags":["BABOK"],"content":"См. BABOK\nОснову работы бизнес-аналитика (БA) составляют 2 понятия:\n\n\nМодель базовых понятий бизнес-анализа BACCM:\n\nКомпетенции бизнес-анализа\n\nПланирование и мониторинг бизнес-анализа\nВыявление и сотрудничество\nУправление жизненным циклом требований\nАнализ стратегии\nАнализ требований и определение дизайна\nОценка решения\n\n\n\nКаждая компетенция включает список задач, которые должен выполнять БА. Результаты выполнения этих задач влияют на базовые понятия модели BACCM. Каким образом влияют, также описано в BABOK Guide."},"posts/С-чего-начинать-новый-проект-внедрения-автоматизации":{"title":"index.html","links":["posts/Определение-стратегии-реализации-проекта"],"tags":[],"content":"Введение\nДанная статья начинает серию публикаций о применении приемов и техник бизнес-анализа, используемых на проектах внедрения автоматизации бизнес-процессов компании.\nМы подробно опишем последовательность всех шагов и действий аналитика при работе над новым проектом. В качестве поясняющего примера будет рассмотрен практический кейс (см. раздел Кейс) отсылка к которому будет в публикациях, описывающих действия аналитика на каждом шаге проекта.\nКонтекст\nЯ являюсь специалистом в области внедрения Битрикс24 в бизнес-процессы компаний. Поэтому вся теоретическая часть и практические примеры будут излагаться в публикациях в контексте автоматизации бизнес-процессов компании в системе Битрикс24. Что это значит?\n\nВ нашем распоряжении есть готовый инструмент автоматизации бизнес-процессов компании - Битрикс24. А значит возможности проекта ограничиваются функциональными возможностями этой системы.\nОграничение возможностей приводит к тому, что не все потребности бизнеса могут быть решены в рамках проекта. Например, как следует из статьи, внедрение Битрикс24 в процессы компании не влияет на такие главные параметры бизнеса как выручка и затраты. Поэтому бизнес цели оптимизации данных параметров в рамках данного контекста не могут быть реализованы.\n\nТем не менее, независимо от контекста в публикациях сохранены общие стратегии и подходы бизнес-анализа. Поэтому надеюсь, что опубликованный материал будет интересен и полезен аналитикам, работающим с проектами в других областях.\nКейс\nКомпания разрабатывает онлайн платформу по предоставлению продуктов и услуг. Руководством принято решение о переводе части бизнес-процессов компании в Битрикс24:\n\nпродажи линейки продуктов компании,\nработа с клиентской базой,\nоперативная и аналитическая отчетность\n\nЗадача аналитика - реализовать проект по внедрению Битрикс24 в бизнес-процессы компании в соответствии с потребностями бизнеса.\nПервый шаг - Определение стратегии реализации проекта"},"posts/Составляем-документ-о-концепциях-и-границах":{"title":"Составляем документ о концепциях и границах","links":["cards/Документ-о-концепции-и-границах-проекта","cards/Контекстная-диаграмма","cards/Карта-экосистемы","cards/Дерево-функций","cards/Список-событий","posts/Определение-стратегии-реализации-проекта"],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nДля чего:для определения стратегии реализации проектаВходная информация:User story бизнес-потребности, дерево факторов роста ценностиВыходная информация:Документ о концепции и границахПрименяемые техники:\n\nТеория\nПотребности бизнеса необходимо трансформировать в бизнес-требования. Для этого предварительно необходимо собрать дополнительную информацию которая будет определять контекст и границы проекта. Собранная информация оформляется в документ о концепции и границах определяет границы на высоком уровне.\nРекомендуемая структура документа и краткое пояснение содержимого каждого раздела приведены в Документ о концепции и границах проекта.\n\n[!Совет]\nДокумент о концепции и границах рекомендуется заполнять не последовательно сверху вниз, а наполнять разные  разделы  по  мере  накопления  информации  в  процессе  работы  над проектом.\n\nДля описания отдельных моментов в Документе может использоваться\nКонтекстная диаграмма\nКарта экосистемы\nДерево функций\nСписок событий\nРазбор кейса\nЕсли пользовательская история бизнес-потребностей, которую мы составили на этапе Определение стратегии реализации проекта является “хотелками” бизнеса, то докумен о концепциях и границах (далее - ДОКУМЕНТ) является формализованным, имеет строгую структуру и может быть включен в список официальной документации нашего проекта.\nВ этом разборе кейса мы кратко остановимся на источниках информации по некоторым ДОКУМЕНТА, и более подробно рассмотрим разделы 2. Рамки и ограничения проекта и 3. Бизнес-контекст"},"theory/Компетенции-бизнес-анализа":{"title":"Компетенции бизнес-анализа","links":["cards/Управление-жизненным-циклом-требований","Анализ-стратегии","cards/Анализ-требований-и-определение-дизайна","cards/Оценка-решения"],"tags":["BABOK"],"content":"\nПланирование и мониторинг бизнес-анализа: описывает задачи, выполняемые бизнес-аналитиками для планирования и координации действий бизнес-аналитиков и заинтересованных сторон. Эти задачи производят результаты, которые используются в качестве основных рекомендаций для выполнения других задач, описанных в руководстве BABOK.\nВыявление и сотрудничество: описывает задачи, которые бизнесаналитик выполняет для подготовки и проведения выяснения и подтверждения полученных результатов. Также описывает коммуникации с заинтересованными сторонами относительно собранной информации бизнес-анализа, а также текущее взаимодействие с ними в ходе всего бизнес-анализа.\nУправление жизненным циклом требований: описывает задачи, выполняемые бизнес-аналитиками для контроля и поддержания информации о требованиях и дизайнах от ее начала до конца ее существования. Эти задачи описывают установление значимых отношений между связанными требованиями и дизайнами, а также оценку, анализ и согласование предлагаемых изменений требований и дизайнов.\nАнализ стратегии: описывает работу по проведению бизнесанализа, подлежащую выполнению для того, чтобы в сотрудничестве с заинтересованными сторонами определить потребность, имеющую стратегическую или тактическую важность (бизнес-потребность), помочь предприятию удовлетворить эту потребность и соотнести итоговую стратегию изменения со стратегиями более высоких и более низких уровней.\nАнализ требований и определение дизайна: описывает задачи, которые бизнес-аналитики выполняют для структурирования и организации требований, обнаруженных в ходе выявления, документирования и моделирования требований и дизайнов, валидации и верификации информации, определения вариантов решения, удовлетворяющих потребности бизнеса и оценки потенциальной ценности каждого варианта. Эта область знания покрывает инкрементальные и итеративные действия, начиная от исходной идеи и исследования потребностей до превращения этих потребностей в конкретное рекомендуемое решение.\nОценка решения: описывает задачи, выполняемые бизнес аналитиками для оценки эффективности и пользы, приносимых решением, используемым в компании, а также рекомендации по устранению преград или ограничений, препятствующих полному извлечению пользы.\n"}}